
&НаКлиенте
Процедура Ответ(Команда)
	ОтветНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтветНаСервере()
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("method","sendMessage");
	ДанныеОтвета.Вставить("chat_id",Объект.chat_id);
	ДанныеОтвета.Вставить("text",Объект.ТекстОтвета);
	
	Т_ОбщегоНазначенияHTTP.ОтветJSON(ДанныеОтвета);
	
		Сообщение = "Тестовое сообщение";
		Токен = "5548921567:AAEhZMUgCk8bFiGZz9239Pw5v6YE3XmF1E8";//Ваш токен telegram
		Сервер = "api.telegram.org";
	    //Ресурс = "bot" + Токен + "/sendMessage?chat_id=" + СтрЗаменить(Формат(Чат, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + Сообщение;
	    Ресурс = "bot" + Токен + "/sendMessage?chat_id=" + Объект.chat_id + "&text=" + Объект.ТекстОтвета;
	    Сообщить(Ресурс);
   		Соединение  =  Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Запрос = Новый HTTPЗапрос(Ресурс);
		Ответ = Соединение.Получить(Запрос);
		Сообщить(Ответ);	
КонецПроцедуры
